Blazemeter_Demo_App.yaml
execution:
  - scenario: Travel_Agency_Test
    concurrency: 10
    ramp-up: 1m
    hold-for: 5m
scenarios:
  Travel_Agency_Test:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.129 Safari/537.36'
    requests:
      - transaction: Launch App
        force-parent-sample: false
        do:
          - url: 'http://blazedemo.com/'
            method: GET
            label: 'http://blazedemo.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'https://bam.nr-data.net/events/1/338cffe5d3?a=6657625&v=1167.2a4546b&to=YVxSYxACCxcEVRFfWlgWcVQWCgoKSg%3D%3D&rst=11503&ref=http://blazedemo.com/'
            method: POST
            label: 'https://bam.nr-data.net/events/1/338cffe5d3?a=6657625&v=1167.2a4546b&to=YVxSYxACCxcEVRFfWlgWcVQWCgoKSg%3D%3D&rst=11503&ref=http://blazedemo.com/'
            headers:
              content-type: text/plain
              Accept: '*/*'
              Sec-Fetch-Site: cross-site
              Sec-Fetch-Mode: cors
              Sec-Fetch-Dest: empty
            body: "bel.6;e,'fp,x4,;e,'fcp,x4,;e,'fi,70r,2;5,'type,'pointerdown;6,'fid,3.;e,'lcp,x4,2;6,'size,32200.;5,'eid"
      - transaction: Find Flight
        force-parent-sample: false
        do:
          - url: 'http://blazedemo.com/reserve.php'
            method: POST
            label: 'http://blazedemo.com/reserve.php'
            think-time: 11310ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Origin: 'http://blazedemo.com'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              fromPort: ${from}
              toPort: ${to}
          - url: 'https://bam.nr-data.net/events/1/338cffe5d3?a=6657625&v=1167.2a4546b&to=YVxSYxACCxcEVRFfWlgWcVQWCgoKSkQARVBET1UZEgsV&rst=11251&ref=http://blazedemo.com/reserve.php'
            method: POST
            label: 'https://bam.nr-data.net/events/1/338cffe5d3?a=6657625&v=1167.2a4546b&to=YVxSYxACCxcEVRFfWlgWcVQWCgoKSkQARVBET1UZEgsV&rst=11251&ref=http://blazedemo.com/reserve.php'
            headers:
              content-type: text/plain
              Accept: '*/*'
              Sec-Fetch-Site: cross-site
              Sec-Fetch-Mode: cors
              Sec-Fetch-Dest: empty
            body: "bel.6;e,'fp,vv,;e,'fcp,vv,"
            data-sources: BlazeMeterDemo_data.csv